tap "buo/cask-upgrade"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "isacikgoz/taps"
tap "martido/graph"
tap "rcmdnk/file"
brew "jpeg-turbo"
brew "autoconf"
brew "bat"
brew "fontconfig"
brew "cairo"
brew "coreutils"
brew "exa"
brew "firefoxpwa"
brew "fribidi"
brew "fzf"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.10"
brew "gobject-introspection"
brew "graphite2"
brew "jasper"
brew "netpbm"
brew "icu4c"
brew "harfbuzz"
brew "python@3.9"
brew "pango"
brew "libtool"
brew "graphviz"
brew "libnghttp2"
brew "libuv"
brew "lua"
brew "macos-trash"
brew "openssl@3"
brew "portaudio"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "sdl2_ttf"
brew "six"
brew "spotify-tui"
brew "spotifyd", restart_service: true
brew "subversion"
brew "tcl-tk"
brew "tmux"
brew "zlib"
brew "zsh"
brew "eth-p/software/bat-extras"
brew "isacikgoz/taps/tldr"
brew "rcmdnk/file/brew-file"
cask "adguard"
cask "appcleaner"
cask "betterdiscord-installer"
cask "betterdisplay"
cask "caprine"
cask "cheatsheet"
cask "cirrus"
cask "customshortcuts"
cask "discord"
cask "fig"
cask "figma"
cask "find-empty-folders"
cask "firefox", args: { appdir: "~/Applications" }
cask "font-barlow"
cask "font-barlow-condensed"
cask "font-barlow-semi-condensed"
cask "font-fira-code-nerd-font"
cask "font-fira-sans"
cask "font-fira-sans-extra-condensed"
cask "font-new-york"
cask "github"
cask "google-drive"
cask "grammarly-desktop"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "macfuse"
cask "mimestream"
cask "no-ip-duc"
cask "quicklook-csv"
cask "quicklook-json"
cask "raycast"
cask "screens-connect"
cask "secretive"
cask "setapp"
cask "sf-symbols"
cask "signal"
cask "spotify"
cask "suspicious-package"
cask "telegram"
cask "veracrypt"
cask "webpquicklook"
